#ifndef AVI_DEFINE_INSPECT_H
#define AVI_DEFINE_INSPECT_H

/**********************************************************************************
 需要在Algorithm DLL和Algorithm Task之间共享的ENUM,结构体等在此定义-仅限AVI
**********************************************************************************/

#pragma once

#include "DefineInterface.h"
#include "DefineInterface_SITE.h"

//////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////

#define PI acos(-1.)

//////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////

// 	E_ALIGN_TYPE_LEFT = 0	,

//[AVIResult结构体]不良颜色

//	E_DEFECT_COLOR_DARK			=0	,	//00暗不良
//	E_DEFECT_COLOR_BRIGHT			,	//01亮不良

// 	E_DEFECT_COLOR_COUNT				// 02 Total

#endif