"""
邢不行™️选币框架
Python数字货币量化投资课程

版权所有 ©️ 邢不行
微信: xbx8662

未经授权，不得复制、修改、或使用本代码的全部或部分内容。仅限个人学习用途，禁止商业用途。

Author: 邢不行
----------------------------------------------------------------------------------------------------

1. 回测策略细节配置
2. 模拟下单回测设置
3. 回测全局设置
"""
from pathlib import Path

from core.utils.path_kit import get_folder_path  # 西蒙斯提供的自动获取绝对路径的函数，若存储目录不存在则自动创建

# ====================================================================================================
# ** 回测策略细节配置 **
# ====================================================================================================
# ** 回测时间配置 **
start_date = '2021-01-01'  # 回测开始时间
end_date = '2099-01-01'  # 回测结束时间
# ** 数据配置 **
# 现货数据路径
spot_path = r'C:\data-center-pro\coin-binance-candle-csv-1h'
# 合约数据
swap_path = r'C:\data-center-pro\coin-binance-swap-candle-csv-1h'
# ** 策略配置 **
backtest_name = '2号VWapBias纯多策略'  # 回测组名称。可以自己任意取。
strategy = {
    "hold_period": "8H",  # 持仓周期，可以是H小时，或者D天。例如：1H，8H，24H，1D，3D，7D...
    # 在这里增加类似market参数，是交易现货还是合约，代替is_pure_long这个参数
    "market": "swap_swap",
    "cap_weight": 1,
    "offset_list": range(8),
    "long_select_coin_num": 0.2,  # 多头选币数量，可为整数或百分比。2 表示 2 个，10 / 100 表示前 10%
    "short_select_coin_num": 0,  # 空头选币数量。除和多头相同外，还支持 'long_nums' 表示与多头数量一致。效

    "factor_list": [  # 选币因子列表
        # 因子名称（与 factors 文件中的名称一致），排序方式（True 为升序，从小到大排，False 为降序，从大到小排），因子参数，因子权重
        ('VWapBias', False, 1000, 1),
        # 可添加多个选币因子
        # ('PctChange', False, 7, 1),
    ],
    "filter_list": [  # 过滤因子列表
        # 因子名称（与 factors 文件中的名称一致），因子参数，因子过滤规则，排序方式
        ('QuoteVolumeMean', 168, 'pct:<0.8'),
    ],
}

is_pure_long = False  # True为纯多模式，False为多空模式。纯多模式下，仅使用现货数据；多空模式下，仅使用合约数据。

# ====================================================================================================
# ** 模拟下单回测设置 **
# ====================================================================================================
initial_usdt = 1_0000  # 初始资金
leverage = 1  # 杠杆数。我看哪个赌狗要把这里改成大于1的。高杠杆如梦幻泡影。不要想着一夜暴富，脚踏实地赚自己该赚的钱。
swap_c_rate = 4 / 10000  # 合约手续费(包含滑点)
spot_c_rate = 1 / 1000  # 现货手续费(包含滑点)

# 策略配置
min_kline_num = 168  # 最少上市多久，不满该K线根数的币剔除，即剔除刚刚上市的新币。168：标识168个小时，即：7*24
black_list = []  # 'BTC-USDT', 'ETH-USDT', 'BNB-USDT'。拉黑名单，永远不会交易。不喜欢的币、异常的币。

# ====================================================================================================
# ** 回测全局设置 **
# 这些设置是客观事实，基本不会影响到回测的细节
# ====================================================================================================

spot_path = Path(spot_path)
swap_path = Path(swap_path)

# 回测结果数据路径。用于发帖脚本使用
backtest_path = Path(get_folder_path('data', '回测结果'))

# 稳定币信息，不参与交易的币种
stable_symbol = ['BKRW', 'USDC', 'USDP', 'TUSD', 'BUSD', 'FDUSD', 'DAI', 'EUR', 'GBP', 'USBP', 'SUSD', 'PAXG', 'AEUR']

if (not spot_path.exists()) or (not swap_path.exists()):
    print('⚠️ 原始行情数据不存在，请检查文件夹路径')
    print(f'当前现货路径：`{str(spot_path)}`', f'当前合约路径：`{str(swap_path)}`')
    exit()
